Repository: OmerFI/python-docs-tr-OLD
Catalog: tutorial/appetite.po
Languages: tr

source: Whetting Your Appetite
tr: İştahınızı Kabartma

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
tr: Bilgisayarlara yönelik çok çalışırsanız, sonunda otomatikleştirmek isteyeceğiniz bazı görevler olduğunu göreceksiniz. Örneğin, çok sayıda metin dosyası üzerinde bir arama ve değiştirme işlemi gerçekleştirmek veya bir grup fotoğraf dosyasını karmaşık bir şekilde yeniden adlandırmak ve yeniden düzenlemek isteyebilirsiniz. Belki de küçük özel bir veritabanı veya özel bir GUI uygulaması veya basit bir oyun yazmak isteyebilirsiniz.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
tr: Eğer profesyonel bir yazılım geliştiricisiyseniz, çeşitli C/C++/Java kütüphaneleriyle çalışmanız gerekebilir. Ancak bunların gündelik yazım/derleme/test/yeniden-derleme döngüsünü çok yavaş bulabilirsiniz. Belkide böyle bir kütüphane için bir test suiti yazacaksınız ama test kodunu yazmayı sıkıcı bir görev olarak göreceksiniz. Veya belki de daha önce bir eklenti dili kullanabilen bir program yazdınız ama programınız için tamamen yeni bir dil tasarlamak ve uygulamak istemiyorsunuz.

source: Python is just the language for you.
tr: Python tam size göre bir dildir.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, Mac OS X, and Unix operating systems, and will help you get the job done more quickly.
tr: Bu görevlerden bazıları için Unix Shell scripti veya Windows batch dosyaları yazabilirsiniz ama Shell scriptleri metin verilerini değiştirmede ve dosyalar arasında dolaşmakta en iyi olmasına rağmen GUI uygulamalar veya oyunlar için tam uygun değildir. C/C++/Java programı yazabilirsiniz ancak ilk taslak programı elde etmek bile çok fazla geliştirme süresi alabilir.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
tr: Python'un kullanımı kolaydır, ancak Shell scriptlerinin veya batch dosyalarının sunabileceğinden çok daha fazla yapı ve büyük programlar için destek sunan gerçek bir programlama dilidir. Öte yandan, Python ayrıca C'den çok daha fazla hata denetimi sunar ve *çok-yüksek-seviyeli-dil* olarak, esnek diziler ve sözlükler gibi gömülü yüksek seviye veri türlerine sahiptir. Python, daha genel veri türleri nedeniyle Awk ve hatta Perl'den çok daha büyük bir sorun alanına uygulanabilir, yine de birçok şey en azından bu dillerde olduğu kadar Python'da da kolaydır.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
tr: Python, programınızı diğer Python programlarında yeniden kullanılabilen modüllere bölmenize izin verir. --- programlarınızın temeli olarak veya Python'da programlamayı öğrenmeye başlamak için örnek olarak kullanabileceğiniz geniş bir standart modül koleksiyonuyla birlikte gelir. Bu modüllerden bazıları dosya I/O (Girdi/Çıktı), sistem çağrıları, soketler ve hatta Tk gibi graphical user interface (grafiksel kullanıcı arayüzü) toolkitlerine arayüzler gibi şeyler sağlar.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
tr: Python, derleme (compilation) ve bağlama (linking) gerektirmediğinden program geliştirme sırasında size önemli ölçüde zaman kazandırabilecek yorumlanmış bir dildir. Yorumlayıcı etkileşimli olarak kullanılabilir, bu da dilin özellikleriyle deneme yapmayı, tek seferlik programlar yazmayı veya aşağıdan yukarıya program geliştirme sırasında fonksiyonları test etmeyi kolaylaştırır. Ayrıca kullanışlı bir masa hesap makinesidir.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
tr: Python, programların kısa ve okunaklı bir şekilde yazılmasını sağlar. Python'da yazılan programlar genel anlamda C, C++ veya Java'da yazılan eşdeğer programlara göre çeşitli nedenlerden dolayı çok daha kısadır:

source: the high-level data types allow you to express complex operations in a single statement;
tr: yüksek seviyeli veri tipleri karışık işlemleri tek komutta ifade etmenize izin verir;

source: statement grouping is done by indentation instead of beginning and ending brackets;
tr: komut gruplama süslü parantezleri açıp kapamak yerine girintiye göre yapılır;

source: no variable or argument declarations are necessary.
tr: değişken veya argüman tanımlamaları gerekli değildir.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
tr: Python *extensible (genişletilebilir)dir*: Eğer C'de programlamayı biliyorsanız, kritik işlemleri maksimum hızda gerçekleştirmek veya Python programlarını yalnızca binary (ikili) biçimde kullanılabilen kütüphanelere (örneğin kodlayana özgü grafik kütüphaneleri) bağlamak için yorumlayıcıya yeni bir gömülü fonksiyon veya modül eklemek kolaydır. Gerçekten bağlandıktan sonra, Python yorumlayıcısını C ile yazılmış bir uygulamaya bağlayabilir ve onu bu uygulama için bir uzantı veya komut dili olarak kullanabilirsiniz.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
tr: Bu arada, dil adını BBC şovu "Monty Python's Flying Circus"dan sonra almıştır ve sürüngenlerle hiçbir alakası yoktur. Dokümantasyonda Monty Python skeçlerine atıfta bulunmak sadece izin verilmekle kalmaz, aynı zaman teşvik edilir!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
tr: Şimdi hepiniz Python için heyecanlısınız ve onu biraz daha ayrıntılı olarak incelemek isteyeceksiniz. Bir dili öğrenmenin en iyi yolu onu kullanmak olduğundan, eğitim sizi, bu eğitimi okurken Python yorumlayıcısıyla oynamaya davet ediyor.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
tr: Bir sonraki bölümde, yorumlayıcının kullanılma mekaniği açıklanmıştır. Bu oldukça sıradan bir bilgidir, ancak daha sonra gösterilen örnekleri denemek için gereklidir.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
tr: Eğitimin geri kalanı, basit ifadeler, durumlar (statements) ve veri türlerinden başlayarak, fonksiyonlar ve modüller aracılığıyla ve son olarak istisnalar (exceptions) ve kullanıcı tanımlı sınıflar (classes) gibi gelişmiş kavramlara değinerek örnekler aracılığıyla Python dilinin ve sisteminin çeşitli özelliklerini tanıtır.
