Repository: OmerFI/python-docs-tr-OLD
Catalog: tutorial/interpreter.po
Languages: tr

source: Using the Python Interpreter
tr: Python Yorumlayıcısını (Interpreter) Kullanma

source: Invoking the Interpreter
tr: Yorumlayıcıyı Çalıştırma

source: The Python interpreter is usually installed as :file:`/usr/local/bin/python3.9` on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
tr: Python yorumlayıcısı (interpreter) mevcut olduğu makinelere genelde :file:`/usr/local/bin/python3.9` olarak kurulur; Unix Shell'inizin arama yoluna (search path) :file:`/usr/local/bin` i koymak aşağıdaki komudu Shell'e yazarak yorumlayıcıyı çalıştırmanızı mümkün kılar:

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
tr: [#]_ Yorumlayıcının bulunduğu dizinin seçimi bir kurulum seçeneği olduğundan, başka yerler de mümkündür. Python uzmanınıza veya sistem yöneticinize danışın. (Örneğin, :file:`/usr/local/python` yaygın bir alternatif konumdur.)

source: On Windows machines where you have installed Python from the :ref:`Microsoft Store <windows-store>`, the :file:`python3.9` command will be available. If you have the :ref:`py.exe launcher <launcher>` installed, you can use the :file:`py` command. See :ref:`setting-envvars` for other ways to launch Python.
tr: :ref:`Microsoft Store <windows-store>` üzerinden Python'u kurduğunuz Windows makinelerinde, :file:`python3.9` komutu mevcut olacaktır. Eğer :ref:`py.exe launcher'ını <launcher>` yüklediyseniz, :file:`py` komutunu kullanabilirsiniz. Python'u daha farklı yollarla çalıştırmak için :ref:`setting-envvars` kısmına bakınız.

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
tr: Birincil komut sorgusuna dosya sonu karakteri yazmak (Unix'te :kbd:`Control-D` , Windows'ta :kbd:`Control-Z`) yorumlayıcının sıfır çıkış durumuyla (zero exit status) çıkmasına neden olur. Eğer bu çalışmazsa şu komutu yazarak yorumlayıcıdan çıkabilirsiniz: ``quit()``.

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
tr: Yorumlayıcının satır düzenleme özellikleri `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ kitaplığını destekleyen sistemlerde, etkileşimli düzenleme (interactive editing), geçmiş değiştirme (history substitution) ve kod tamamlamayı (code completion) içerir. Komut satırı düzenlemesinin desteklenip desteklenmediğini görmek için belki de en hızlı yol, aldığınız ilk Python sorgusuna :kbd:`Control-P` yazmaktır. Eğer bip sesi çıkarırsa, komut satırı düzenleme özelliği vardır; tuşlar hakkında daha fazlası için bkz. :ref:`tut-interacting`. Eğer hiçbir şey olmuyorsa veya ``^P`` şeklinde cevap alınılıyorsa, komut satırı düzenleme özelliği aktif değildir ve mevcut satırdan karakterleri silmek için sadece backspace tuşuna basabilirsiniz.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
tr: Yorumlayıcı (interpreter) bir yere kadar Unix shell'i gibi çalışır: tty cihazına bağlı standart girdi ile çağrıldığında, komutları etkileşimli olarak okur ve çalıştırır; argüman olarak bir dosya adı veya standart girdiye bir dosya verilip çağırıldığında, o dosyadan bir *script* i okur ve çalıştırır.

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety with single quotes.
tr: Yorumlayıcıyı çalıştırmanın ikinci bir yolu da ifade/ifadeleri *command* kısmında çalıştıran ``python -c komut [arg] ...`` kodudur (shell'in -c parametresine benzer). Python ifadeleri genellikle shell'e özel boşluklar veya diğer karakterler içerdiğinden, genellikle tek tırnak ile *komutun tamamını* tırnaklar arasına almanız önerilir.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
tr: Bazı Python modülleri de scriptler gibi kullanışlıdır. Bunlar, *modülün* kaynak dosyasını komut satırında tam adını yazmışsınız gibi çalıştıran ``python -m modül [arg] ...`` komutu kullanılarak çağrılabilir.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
tr: Script dosyası kullanıldığı zaman, script'i çalıştırabilmek ve sonradan etkileşimli moda girmek bazen kullanışlıdır. Bu scriptten önce :option:`-i` ekleyerek yapılabilir.

source: All command line options are described in :ref:`using-on-general`.
tr: Tüm komut satırı seçenekleri :ref:`using-on-general` kısmında açıklanmıştır.

source: Argument Passing
tr: Argüman Ekleme

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
tr: Yorumlayıcı tarafından script dosyası adı ve ek argümanlar bilindikten sonra içinde string barındıran bir listeye bunlar dönüştürülür ve ``sys`` modülündeki ``argv`` değişkenine atanır. ``import sys`` komutunu çalıştırarak bu listeye erişebilirsiniz. Bu listenin uzunluğu en az 1'dir. herhangi bir script veya argüman verilmediği zaman ``sys.argv[0]`` boş bir stringtir. Script adı ``'-'`` olarak verildiği zaman (standart girdi manasına gelir), ``sys.arg[0]`` ```'-'`` ye eşitlenir. :option:`-c` *komut* kullanıldığı zaman ``sys.argv[0]`` ``'-c'`` ye eşitlenir. :option:`-m` *modül* kullanıldığı zaman ``sys.argv[0]`` bulunan modülün tam adına eşitlenir. :option:`-c` *komutundan* veya :option:`-m` *modülünden* sonra bulunan seçenekler Python yorumlayıcısının seçenek/parametre ayrıştırması tarafından bir önemi olmaz, ancak komutun veya modülün yönetilebilmesi için sys.argv'de bırakılır.

source: Interactive Mode
tr: Etkileşimli Mod

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
tr: Komutlar *tty*den okunduğu zaman, yorumlayıcıya *etkileşimli mod*da olunması söylenir. Bu modda sonraki komut için *primary prompt* ile istekte bulunulur (genelde 3 tane büyüktür sembolüdür (``>>>``)); devam satırları (continuation lines) için *secondary prompt* ile istekte bulunulur (varsayılan olarak 3 tane nokta şeklinde (``...``)). Yorumlayıcı, ilk komut istemini yazdırmadan önce sürüm numarasını ve bir telif hakkı bildirimini belirten bir hoş geldiniz mesajı yazdırır:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
tr: Çok satırlı bir yapıya girerken devam satırlarına (continuation lines) ihtiyaç vardır. Bir örnek olarak şu :keyword:`if` ifadesine bakınız::

source: For more on interactive mode, see :ref:`tut-interac`.
tr: Etkileşimli mod ile ilgili daha fazlası için :ref:`tut-interac` kısmına bakınız.

source: The Interpreter and Its Environment
tr: Yorumlayıcı ve Yorumlayıcının Ortamı

source: Source Code Encoding
tr: Kaynak Kod Encoding

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
tr: Varsayılan olarak, Python kaynak (source) dosyaları UTF-8 ile encode (karakter kodlanması) edilmiştir. Bu encodingte (karakter kodlanması), dünyadaki çoğu dilin karakterleri harflerden oluşan stringlerde, tanımlayıcılarda (identifiers) ve yorumlarda aynı anda kullanılabilir --- standart kütüphane tanımlayıcılar (identifiers) için yalnızca ASCII karakterleri kullansa da herhangi bir taşınabilir (portable) kodun izlemesi gereken bir kuraldır. Tüm bu karakterleri düzgün şekilde göstermek için, sizin editörünüzün (metin düzenleyicinizin) dosyanın UTF-8 ile encode edildiğini anlaması gerekir ve editörünüz dosyadaki tüm karakterleri destekleyen bir yazı tipi (font) kullanmalıdır.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
tr: Varsayılandan farklı bir encoding (karakter kodlama türü) bildirmek için, dosyanın ilk satırına özel bir açıklama satırı eklenmelidir. Sözdizimi aşağıdaki gibidir::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
tr: burada *encoding* Python tarafından desteklenen geçerli :mod:`codecs` lerden biridir.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
tr: Örneğin, Windows-1252 encoding'inin kullanılacağını bildirmek için, kaynak kod dosyanızın ilk satırı şöyle olmalıdır::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
tr: İlk satır kuralının bir istisnası olarak, kaynak kodun bir :ref:`UNIX "shebang" satırıyla <tut-scripts>` başlaması gösterilebilir. Bu durumda, encoding tanımlaması dosyanın ikinci satırında eklenmelidir. Örneğin::

source: Footnotes
tr: Dipnotlar

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
tr: Unix'te, Python 3.x yorumlayıcısı, ``python`` isimli çalıştırılabilir komut ile varsayılan olarak yüklenmez ve böylece eş zamanlı yüklenmiş bir Python 2.x çalıştırılabilir dosyasıyla da çakışmaz.
