Repository: OmerFI/python-docs-tr-OLD
Catalog: license.po
Languages: tr

source: 0.9.0 thru 1.2
tr: 0.9.0 ila 1.2 arası

source: 1.3 thru 1.5.2
tr: 1.3 ile 1.5.2 arası

source: 2.2 and above
tr: 2.2 ve üstü

source: 2001-now
tr: 2001-şimdi

source: All Python releases are Open Source (see https://opensource.org/ for the Open Source Definition). Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases.
tr: Tüm Python sürümleri Açık Kaynaktır (Açık Kaynak Tanımı için https://opensource.org/ bakın). Tarihsel olarak, çoğu, ancak hepsi değil, Python sürümleri de GPL uyumlu olmuştur; aşağıdaki tabloda çeşitli sürümler özetlenmiştir.

source: Asynchronous socket services
tr: Asenkron soket hizmetleri

source: BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1
tr: BEOPEN PYTHON AÇIK KAYNAK LİSANS ANLAŞMASI SÜRÜM 1

source: BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0
tr: PYTHON 2.0 İÇİN BEOPEN.COM LİSANS ANLAŞMASI

source: CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1
tr: PYTHON 1.6.1 İÇİN CNRI LİSANS ANLAŞMASI

source: CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2
tr: PYTHON 0.9.0 - 1.2 İÇİN CWI LİSANS ANLAŞMASI

source: Cookie management
tr: Çerez (cookie) yönetimi

source: Derived from
tr: Den türetilmiş

source: Execution tracing
tr: Yürütme izleme

source: GPL compatible?
tr: GPL uyumlu mu?

source: GPL-compatible doesn't mean that we're distributing Python under the GPL. All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source. The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't.
tr: GPL uyumlu olması, Python'u GPL altında dağıttığımız anlamına gelmez. Tüm Python lisansları, GPL'nin aksine, değişikliklerinizi açık kaynak yapmadan değiştirilmiş bir sürümü dağıtmanıza izin verir. GPL uyumlu lisanslar, Python'u GPL altında yayımlanan diğer yazılımlarla birleştirmeyi mümkün kılar; diğerleri için geçerli değildir.

source: History and License
tr: Tarih ve Lisans

source: History of the software
tr: Yazılımın Tarihi

source: In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see https://www.cnri.reston.va.us/) in Reston, Virginia where he released several versions of the software.
tr: 1995'te Guido, Python'daki çalışmalarına Reston, Virginia'daki Ulusal Araştırma Girişimleri Kurumu'nda (CNRI, bkz. https://www.cnri.reston.va.us/) devam etti ve burada yazılımın çeşitli sürümlerini yayınladı.

source: In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team. In October of the same year, the PythonLabs team moved to Digital Creations (now Zope Corporation; see https://www.zope.org/). In 2001, the Python Software Foundation (PSF, see https://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation is a sponsoring member of the PSF.
tr: Mayıs 2000'de Guido ve Python çekirdek geliştirme ekibi, BeOpen PythonLabs ekibini oluşturmak için BeOpen.com'a taşındı. Aynı yılın Ekim ayında PythonLabs ekibi Digital Creations'a taşındı (şimdi Zope Corporation; bkz. https://www.zope.org/). 2001 yılında, özellikle Python ile ilgili Fikri Mülkiyete sahip olmak için oluşturulan kar amacı gütmeyen bir kuruluş olan Python Software Foundation (PSF, bkz. https://www.python.org/psf/) kuruldu. Zope Corporation, PSF'nin sponsor üyesidir.

source: Licenses and Acknowledgements for Incorporated Software
tr: Birleşmiş Yazılım için Lisansları ve Onayları

source: Owner
tr: Sahibi

source: PSF LICENSE AGREEMENT FOR PYTHON |release|
tr: PYTHON |release| İÇİN PSF LİSANS ANLAŞMASI

source: Python software and documentation are licensed under the :ref:`PSF License Agreement <PSF-license>`.
tr: Python yazılımı ve dokümantasyonu :ref:`PSF Lisans Anlaşması <PSF-license>` altında lisanslanmıştır.

source: Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see https://www.cwi.nl/) in the Netherlands as a successor of a language called ABC. Guido remains Python's principal author, although it includes many contributions from others.
tr: Python, 1990'ların başında Hollanda'daki Stichting Mathematisch Centrum'da (CWI, bkz. https://www.cwi.nl/) Guido van Rossum tarafından ABC adlı bir dilin halefi olarak oluşturuldu. Guido, başkalarının birçok katkılarını içermelerine rağmen Python'un baş yazarı olmaya devam ediyor.

source: Release
tr: Sürüm

source: Select kqueue
tr: kqueue Seçimi

source: Sockets
tr: Soketler

source: Some software incorporated into Python is under different licenses. The licenses are listed with code falling under that license. See :ref:`OtherLicenses` for an incomplete list of these licenses.
tr: Python'a dahil edilen bazı yazılımlar farklı lisanslar altındadır. Lisanslar, bu lisansın kapsamına giren yasalarla listelenir. Bu lisansların tamamlanmamış listesi için bkz: :ref:`OtherLicenses`.

source: Starting with Python 3.8.6, examples, recipes, and other code in the documentation are dual licensed under the PSF License Agreement and the :ref:`Zero-Clause BSD license <BSD0>`.
tr: Python 3.8.6'dan başlayarak, belgelerdeki örnekler, formüller ve diğer kodlar PSF Lisans Sözleşmesi ve ref:`Zero-Clause BSD lisansı <BSD0>` altında çift lisanslıdır.

source: Terms and conditions for accessing or otherwise using Python
tr: Python'a erişmek veya Python'u başka bir şekilde kullanmak için hüküm ve koşullar

source: Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible.
tr: Bu sürümleri mümkün kılmak için Guido'nun yönlendirmesi altında çalışan birçok dışarıdan gönüllüye teşekkürler.

source: The :mod:`_ctypes` extension is built using an included copy of the libffi sources unless the build is configured ``--with-system-libffi``::
tr: :mod:`_ctypes` eklentisi ``--with-system-libffi`` şeklinde ayarlanmadığı sürece libffi kaynağının dahil edilen bir kopyasını kullanarak oluşturulur::

source: The :mod:`_decimal` module is built using an included copy of the libmpdec library unless the build is configured ``--with-system-libmpdec``::
tr: :mod:`_decimal` modülü ``--with-system-libmpdec`` şeklinde yapılandırılmadığı müddetçe libmpdec kütüphanesinin dahil edilen bir kopyası kullanılarak oluşturulur::

source: The :mod:`_random` module includes code based on a download from http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. The following are the verbatim comments from the original code::
tr: :mod:`_random` modülü, http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html adresinden indirmeye dayalı kodu içerir. Aşağıdakiler orijinal koddan birebir yorumlardır::

source: The :mod:`asynchat` and :mod:`asyncore` modules contain the following notice::
tr: :mod:`asynchat` ve :mod:`asyncore` modülleri aşağıdaki bildiriyi içerir::

source: The :mod:`http.cookies` module contains the following notice::
tr: :mod:`http.cookies` modülü aşağıdaki bildiriyi içerir::

source: The :mod:`pyexpat` extension is built using an included copy of the expat sources unless the build is configured ``--with-system-expat``::
tr: :mod:`pyexpat` eklentisi ``--with-system-expat`` şeklinde ayarlanmadığı müddetçe, expat kaynaklarının dahil edilen bir kopyası kullanılarak oluşturulur::

source: The :mod:`select` module contains the following notice for the kqueue interface::
tr: :mod:`select` modülü kqueue arayüzü için aşağıdaki bildiriyi içerir::

source: The :mod:`socket` module uses the functions, :func:`getaddrinfo`, and :func:`getnameinfo`, which are coded in separate source files from the WIDE Project, http://www.wide.ad.jp/. ::
tr: :mod:`socket` modülü WIDE Projesinden (http://www.wide.ad.jp/ ::) farklı farklı kaynak dosyalarından kodlanan :func:`getaddrinfo` ve :func:`getnameinfo` fonksiyonlarını kullanır.::

source: The :mod:`test_epoll` module contains the following notice::
tr: :mod:`test_epoll` modülü aşağıdaki bildiriyi içerir::

source: The :mod:`trace` module contains the following notice::
tr: :mod:`trace` modülü aşağıdaki bildiriyi içerir::

source: The :mod:`uu` module contains the following notice::
tr: :mod:`uu` modülü aşağıdaki bildiriyi içerir::

source: The :mod:`xmlrpc.client` module contains the following notice::
tr: :mod:`xmlrpc.client` modülü aşağıdaki bildiriyi içerir::

source: The :mod:`zlib` extension is built using an included copy of the zlib sources if the zlib version found on the system is too old to be used for the build::
tr: :mod:`zlib` eklentisi zlib kaynaklarının dahil edilen bir kopyası kullanılarak eğer sistemde bulunan zlib sürümü, derleme için kullanılamayacak kadar eskiyse oluşturulur::

source: The C14N 2.0 test suite in the :mod:`test` package (``Lib/test/xmltestdata/c14n-20/``) was retrieved from the W3C website at https://www.w3.org/TR/xml-c14n2-testcases/ and is distributed under the 3-clause BSD license:
tr: Test paketindeki (``Lib/test/xmltestdata/c14n-20/``) C14N 2.0 test suiti https://www.w3.org/TR/xml-c14n2-testcases/ adresindeki W3C web sitesinden alındı ​​ve 3 maddeli BSD lisansı altında dağıtılmaktadır:

source: The file :file:`Python/dtoa.c`, which supplies C functions dtoa and strtod for conversion of C doubles to and from strings, is derived from the file of the same name by David M. Gay, currently available from http://www.netlib.org/fp/. The original file, as retrieved on March 16, 2009, contains the following copyright and licensing notice::
tr: C double'larının stringe/stringden dönüştürülmesi için C fonksiyonları dtoa ve strtod'nı sağlayan :file:`Python/dtoa.c` dosyası, şu anda http://www.netlib.org adresinde bulunan David M. Gay tarafından aynı adlı dosyadan türetilmiştir. Orijinal dosya, 16 Mart 2009'de geri alınan, aşağıdaki telif hakkı ve lisans bildirisini içerir::

source: The file :file:`Python/pyhash.c` contains Marek Majkowski' implementation of Dan Bernstein's SipHash24 algorithm. It contains the following note::
tr: :file:`Python/pyhash.c` dosyası, Marek Majkowski'nin Dan Bernstein'ın SipHash24 algoritmasını uygulamasını içerir. Aynı zamanda aşağıdaki notu da içerir:

source: The implementation of the hash table used by the :mod:`tracemalloc` is based on the cfuhash project::
tr: :mod:`tracemalloc` tarafından kullanılan hash tablosunun uygulanması *cfuhash* projesine dayanmaktadır::

source: The modules :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` use the OpenSSL library for added performance if made available by the operating system. Additionally, the Windows and Mac OS X installers for Python may include a copy of the OpenSSL libraries, so we include a copy of the OpenSSL license here::
tr: :mod:`hashlib`, :mod:`posix`, :mod:`ssl` ve :mod:`crypt` modülleri ek performans için eğer işletim sistemi için kullanılabilir hale getirilirse OpenSSL kütüphanesini kullanır. İlave olarak, Python için Windows ve Mac OS X yükleyicileri OpenSSL kütüphanesinin bir kopyasını içerebilir, böylece biz de buraya OpenSSL lisansının bir kopyasını dahil ediyoruz::

source: This section is an incomplete, but growing list of licenses and acknowledgements for third-party software incorporated in the Python distribution.
tr: Bu bölüm, Python dağıtımına dahil edilen üçüncü taraf yazılımlar için eksik, ancak büyüyen bir lisans ve onay listesidir.

source: UUencode and UUdecode functions
tr: UUencode ve UUdecode fonksiyonları

source: W3C C14N test suite
tr: W3C C14N test suiti

source: XML Remote Procedure Calls
tr: XML Uzaktan Prosedür Çağrıları

source: Year
tr: Yıl

source: ZERO-CLAUSE BSD LICENSE FOR CODE IN THE PYTHON |release| DOCUMENTATION
tr: PYTHON |release| DOKÜMANTASYONU İÇİN ZERO-CLAUSE BSD LİSANSI

source: no
tr: hayır

source: strtod and dtoa
tr: strtod ve dtoa

source: yes
tr: evet
