Repository: OmerFI/python-docs-tr-OLD
Catalog: sphinx.po
Languages: tr

source: This Page
tr: Bu Sayfa

source: Report a Bug
tr: Bir Hata Bildir

source: Show Source
tr: Kaynak Kodu Göster

source: CPython implementation detail:
tr: CPython uygulanma detayları:

source: Deprecated since version {deprecated}, will be removed in version {removed}
tr: {deprecated} sürümünden beri artık kullanılmamaktadır ve {removed} sürümünden itibaren kaldırılacaktır

source: Deprecated since version {deprecated}, removed in version {removed}
tr: {deprecated} sürümünden beri artık kullanılmamaktadır ve {removed} sürümünden itibaren kaldırılmıştır

source: Welcome! This is the documentation for Python %(release)s.
tr: Hoş geldiniz! Bu dokümantasyon Python %(release) içindir.

source: Parts of the documentation:
tr: Dokümantasyonun bölümleri:

source: What's new in Python %(version)s?
tr: Python %(version) sürümünde yenilikler neler?

source: or <a href="%(whatsnew_index)s">all "What's new" documents</a> since 2.0
tr: veya 2.0'dan itibaren <a href="%(whatsnew_index)s">tüm "Yenilikler" dokümanları</a>

source: Tutorial
tr: Eğitim

source: start here
tr: buradan başlayın

source: Library Reference
tr: Kütüphane Referansı

source: keep this under your pillow
tr: bunu yastığının altında tut

source: Language Reference
tr: Dil Referansı

source: describes syntax and language elements
tr: sözdizimi ve dil öğelerini açıklar

source: Python Setup and Usage
tr: Python Kurulumu ve Kullanımı

source: how to use Python on different platforms
tr: diğer platformlarda Python nasıl kullanılır

source: Python HOWTOs
tr: Python NASIL'ları

source: in-depth documents on specific topics
tr: belirli konular hakkında derinlemesine dokümanlar

source: Installing Python Modules
tr: Python Modüllerini Yükleme

source: installing from the Python Package Index &amp; other sources
tr: Python Paket İndeksinden &amp; diğer kaynaklardan indirme

source: Distributing Python Modules
tr: Python Modüllerini Dağıtma

source: publishing modules for installation by others
tr: başkaları tarafından indirilebilmesi için modülleri yayınlama

source: Extending and Embedding
tr: Genişletme ve Gömme

source: tutorial for C/C++ programmers
tr: C/C++ programlayıcıları için eğitim

source: reference for C/C++ programmers
tr: C/C++ programlayıcıları için referans

source: FAQs
tr: SSS

source: frequently asked questions (with answers!)
tr: sıkça sorulan sorular (cevaplarıyla!)

source: Indices and tables:
tr: İndeksler ve tablolar:

source: Global Module Index
tr: Evrensel Modül İndeksi

source: quick access to all modules
tr: tüm modüllere hızlı erişim

source: General Index
tr: Genel İndeks

source: all functions, classes, terms
tr: tüm fonksiyonlar, sınıflar, terimler

source: Glossary
tr: Terimler Sözlüğü

source: the most important terms explained
tr: en önemli terimler açıklandı

source: Search page
tr: Arama sayfası

source: search this documentation
tr: bu dokümantasyonda ara

source: Complete Table of Contents
tr: Tüm İçerik

source: lists all sections and subsections
tr: tüm bölümleri ve alt bölümleri listeler

source: Meta information:
tr: Meta bilgisi:

source: Reporting bugs
tr: Hataların bildirimi

source: Contributing to Docs
tr: Dokümantasyonlara Katkıda Bulunmak

source: About the documentation
tr: Dokümantasyon Hakkında

source: History and License of Python
tr: Python'un Tarihi ve Lisansı

source: Copyright
tr: Telif Hakkı

source: Download
tr: İndir

source: Download these documents
tr: Bu dokümanları indir

source: Docs by version
tr: Sürüme göre dokümantasyonlar

source: Python 3.10 (in development)
tr: Python 3.10 (geliştirme aşamasında)

source: Python 3.9 (pre-release)
tr: Python 3.9 (ön sürüm)

source: Python 3.8 (stable)
tr: Python 3.8 (kararlı)

source: Python 3.7 (stable)
tr: Python 3.7 (kararlı)

source: Python 3.6 (security-fixes)
tr: Python 3.6 (güvenlik düzeltmeleri)

source: All versions
tr: Tüm sürümler

source: Other resources
tr: Diğer kaynaklar

source: PEP Index
tr: PEP İndeksi

source: Beginner's Guide
tr: Yeni Başlayanların Kılavuzu

source: Book List
tr: Kitap Listesi

source: Audio/Visual Talks
tr: Sesli/Görsel Konuşmalar

source: Python Developer’s Guide
tr: Python Geliştirici Kılavuzu

source: This document is for an old version of Python that is no longer supported. You should upgrade, and read the
tr: Bu doküman Python'un artık desteklenmeyen eski bir sürümü içindir. Güncellemelisiniz ve bunu okumalısınız

source: Python documentation for the current stable release
tr: şuanki kararlı Python sürümü için dokümantasyon

source: Documentation
tr: Dokümantasyon
